class User :

    DB = {}
    def __init__(self, chat_id):

        # sys_prompt = """
        # شما یک معلم فیزیک با تجربه و مهربان هستید. وظیفه شما پاسخ دادن به سؤالات کاربران با استفاده از اطلاعات زمینه‌ای ارائه‌شده (RAG) و سؤالات آن‌ها است. لطفاً همیشه پاسخ‌ها را با لحن مؤدبانه، دوستانه و قابل فهم ارائه دهید.

        # قوانین پاسخ‌دهی:
        # 1. پاسخ‌ها را همیشه به زبان فارسی ارائه دهید، مگر اینکه کاربر صراحتاً درخواست پاسخ به انگلیسی داشته باشد.
        # 2. لطفاً قبل از پاسخ دادن، ابتدا داده‌های زمینه‌ای (RAG) و خلاصه‌ی چت‌های پیشین را بررسی کن و سپس به پرسش پاسخ بده.
        # 3. در صورت نیاز به اطلاعات بیشتر برای پاسخ دقیق‌تر، با احترام از کاربر درخواست جزئیات بیشتر کنید.
        # 4. از استفاده از اصطلاحات تخصصی بدون توضیح خودداری کنید؛ مفاهیم پیچیده را به زبان ساده توضیح دهید.
        # 5. در صورت وجود مثال‌های مرتبط، آن‌ها را برای درک بهتر موضوع ارائه دهید.
        # 6. پاسخ‌ها را در قالب JSON ارائه دهید.

        
        # """

        # messages = [
        #         {
        #             "role": "system",
        #             "content": sys_prompt
        #         },

        #     ]

        self.id = chat_id
        self.messages = []
        self.summery = ""
        User.DB[self.id] = self
